dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
//hardware specific port for ARMduino to STM32F10x family

#include "armduino_stm32f0xx.h"						//we use aruidno GPIO port for stm32F
#include "armduino.h"								//use ARMduino specific definitions

//global definitions

#define PWM_PR			((1ul<<PWMOUT_BITs) - 1)			//period for 16-bit pwm

//struct used to map a pin to GPIO+mask
typedef struct {
	GPIO_TypeDef *gpio;					//gpio for a pin
	uint16_t mask;						//pin mask - 16bit
} PIN2GPIO;

//empty handler
static void empty_handler(void) {
	//do nothing here
}

//user isr
void (*_isrptr_exti[16])(void);			//user handler for EXTI interrupt

//exti interrupt handlers
void EXTI0_1_IRQHandler(void) {
	if (EXTI->PR & (1<<0)) {
		EXTI->PR |= (1<<0);				//clear the flag by writing '1' to it
		_isrptr_exti[0]();				//execute the user handler
	}

	if (EXTI->PR & (1<<1)) {
		EXTI->PR |= (1<<1);				//clear the flag by writing '1' to it
		_isrptr_exti[1]();				//execute the user handler
	}
}

void EXTI2_3_IRQHandler(void) {
	if (EXTI->PR & (1<<2)) {
		EXTI->PR |= (1<<2);				//clear the flag by writing '1' to it
		_isrptr_exti[2]();				//execute the user handler
	}
	if (EXTI->PR & (1<<3)) {
		EXTI->PR |= (1<<3);				//clear the flag by writing '1' to it
		_isrptr_exti[3]();				//execute the user handler
	}
}

void EXTI4_15IRQHandler(void) {
	if (EXTI->PR & (1<<4)) {
		EXTI->PR |= (1<<4);				//clear the flag by writing '1' to it
		_isrptr_exti[4]();				//execute the user handler
	}

	if (EXTI->PR & (1<<5)) {
		EXTI->PR |= (1<<5);				//clear the flag by writing '1' to it
		_isrptr_exti[5]();				//execute the user handler
	}

	if (EXTI->PR & (1<<6)) {
		EXTI->PR |= (1<<6);				//clear the flag by writing '1' to it
		_isrptr_exti[6]();				//execute the user handler
	}

	if (EXTI->PR & (1<<7)) {
		EXTI->PR |= (1<<7);				//clear the flag by writing '1' to it
		_isrptr_exti[7]();				//execute the user handler
	}

	if (EXTI->PR & (1<<8)) {
		EXTI->PR |= (1<<8);				//clear the flag by writing '1' to it
		_isrptr_exti[8]();				//execute the user handler
	}

	if (EXTI->PR & (1<<9)) {
		EXTI->PR |= (1<<9);				//clear the flag by writing '1' to it
		_isrptr_exti[9]();				//execute the user handler
	}

	if (EXTI->PR & (1<<10)) {
		EXTI->PR |= (1<<10);			//clear the flag by writing '1' to it
		_isrptr_exti[10]();				//execute the user handler
	}

	if (EXTI->PR & (1<<11)) {
		EXTI->PR |= (1<<11);			//clear the flag by writing '1' to it
		_isrptr_exti[11]();				//execute the user handler
	}

	if (EXTI->PR & (1<<12)) {
		EXTI->PR |= (1<<12);			//clear the flag by writing '1' to it
		_isrptr_exti[12]();				//execute the user handler
	}

	if (EXTI->PR & (1<<13)) {
		EXTI->PR |= (1<<13);			//clear the flag by writing '1' to it
		_isrptr_exti[13]();				//execute the user handler
	}

	if (EXTI->PR & (1<<14)) {
		EXTI->PR |= (1<<14);			//clear the flag by writing '1' to it
		_isrptr_exti[14]();				//execute the user handler
	}

	if (EXTI->PR & (1<<15)) {
		EXTI->PR |= (1<<15);			//clear the flag by writing '1' to it
		_isrptr_exti[15]();				//execute the user handler
	}
}

//end exti handlers

//timer handlers
#if defined(USE_TIM1)
//global variables
static void (* _tim1_oc1isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_oc2isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_oc3isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_oc4isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default

static uint32_t _tim1_oc1=0;				//output compare registers
static uint32_t _tim1_oc2=0;
static uint32_t _tim1_oc3=0;
static uint32_t _tim1_oc4=0;

//isr for timer1 capture / compare
void TIM1_CC_IRQHandler(void) {
	//oc1 portion
	if (TIM1->SR & TIM_SR_CC1IF) {		//output compare 1 flag is set
		TIM1->SR &=~TIM_SR_CC1IF;		//clear the flag
		TIM1->CCR1 += _tim1_oc1;			//update the output compare register
		_tim1_oc1isrptr();				//execute user handler
	}

	//oc2 portion
	if (TIM1->SR & TIM_SR_CC2IF) {		//output compare 2 flag is set
		TIM1->SR &=~TIM_SR_CC2IF;		//clear the flag
		TIM1->CCR2 += _tim1_oc2;			//update the output compare register
		_tim1_oc2isrptr();				//execute user handler
	}

	//oc3 portion
	if (TIM1->SR & TIM_SR_CC3IF) {		//output compare 2 flag is set
		TIM1->SR &=~TIM_SR_CC3IF;		//clear the flag
		TIM1->CCR3 += _tim1_oc3;			//update the output compare register
		_tim1_oc3isrptr();				//execute user handler
	}

	//oc4 portion
	if (TIM1->SR & TIM_SR_CC4IF) {		//output compare 2 flag is set
		TIM1->SR &=~TIM_SR_CC4IF;		//clear the flag
		TIM1->CCR4 += _tim1_oc4;			//update the output compare register
		_tim1_oc4isrptr();				//execute user handler
	}
}
#endif
//TIM2 not present on all chips
#if defined(USE_TIM2)
//global variables
static void (* _tim2_oc1isrptr)(void)=empty_handler;				//tim2_ptr pointing to empty_handler by default
static void (* _tim2_oc2isrptr)(void)=empty_handler;				//tim2_ptr pointing to empty_handler by default
static void (* _tim2_oc3isrptr)(void)=empty_handler;				//tim2_ptr pointing to empty_handler by default
static void (* _tim2_oc4isrptr)(void)=empty_handler;				//tim2_ptr pointing to empty_handler by default

static uint32_t _tim2_oc1=0;				//output compare registers
static uint32_t _tim2_oc2=0;
static uint32_t _tim2_oc3=0;
static uint32_t _tim2_oc4=0;

//isr for timer1 capture / compare
void TIM2_IRQHandler(void) {
	//oc1 portion
	if (TIM2->SR & TIM_SR_CC1IF) {		//output compare 1 flag is set
		TIM2->SR &=~TIM_SR_CC1IF;		//clear the flag
		TIM2->CCR1 += _tim2_oc1;			//update the output compare register
		_tim2_oc1isrptr();				//execute user handler
	}

	//oc2 portion
	if (TIM2->SR & TIM_SR_CC2IF) {		//output compare 2 flag is set
		TIM2->SR &=~TIM_SR_CC2IF;		//clear the flag
		TIM2->CCR2 += _tim2_oc2;			//update the output compare register
		_tim2_oc2isrptr();				//execute user handler
	}

	//oc3 portion
	if (TIM2->SR & TIM_SR_CC3IF) {		//output compare 2 flag is set
		TIM2->SR &=~TIM_SR_CC3IF;		//clear the flag
		TIM2->CCR3 += _tim2_oc3;			//update the output compare register
		_tim2_oc3isrptr();				//execute user handler
	}

	//oc4 portion
	if (TIM2->SR & TIM_SR_CC4IF) {		//output compare 2 flag is set
		TIM2->SR &=~TIM_SR_CC4IF;		//clear the flag
		TIM2->CCR4 += _tim2_oc4;			//update the output compare register
		_tim2_oc4isrptr();				//execute user handler
	}
}
#endif

#if defined(USE_TIM3)
//global variables
static void (* _tim3_oc1isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim3_oc2isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim3_oc3isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default
static void (* _tim3_oc4isrptr)(void)=empty_handler;				//tim3_ptr pointing to empty_handler by default

