dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
static uint32_t _tim3_oc1=0;				//output compare registers
static uint32_t _tim3_oc2=0;
static uint32_t _tim3_oc3=0;
static uint32_t _tim3_oc4=0;

//isr for timer1 capture / compare
void TIM3_IRQHandler(void) {
	//oc1 portion
	if (TIM3->SR & TIM_SR_CC1IF) {		//output compare 1 flag is set
		TIM3->SR &=~TIM_SR_CC1IF;		//clear the flag
		TIM3->CCR1 += _tim3_oc1;			//update the output compare register
		_tim3_oc1isrptr();				//execute user handler
	}

	//oc2 portion
	if (TIM3->SR & TIM_SR_CC2IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC2IF;		//clear the flag
		TIM3->CCR2 += _tim3_oc2;			//update the output compare register
		_tim3_oc2isrptr();				//execute user handler
	}

	//oc3 portion
	if (TIM3->SR & TIM_SR_CC3IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC3IF;		//clear the flag
		TIM3->CCR3 += _tim3_oc3;			//update the output compare register
		_tim3_oc3isrptr();				//execute user handler
	}

	//oc4 portion
	if (TIM3->SR & TIM_SR_CC4IF) {		//output compare 2 flag is set
		TIM3->SR &=~TIM_SR_CC4IF;		//clear the flag
		TIM3->CCR4 += _tim3_oc4;			//update the output compare register
		_tim3_oc4isrptr();				//execute user handler
	}
}
#endif

#if defined(USE_TIM14)
//global variables
static void (* _tim14_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM14_IRQHandler(void) {
	TIM14->SR &=~TIM_SR_UIF;		//clear the flag
	_tim14_isrptr();				//execute user handler
}
#endif

//TIM15 not present on all chips
#if defined(USE_TIM15)
//global variables
static void (* _tim15_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM15_IRQHandler(void) {
	TIM15->SR &=~TIM_SR_UIF;		//clear the flag
	_tim15_isrptr();				//execute user handler
}
#endif

#if defined(USE_TIM16)
//global variables
static void (* _tim16_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM16_IRQHandler(void) {
	TIM16->SR &=~TIM_SR_UIF;		//clear the flag
	_tim16_isrptr();				//execute user handler
}
#endif

#if defined(USE_TIM17)
//global variables
static void (* _tim17_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default

//isr for timer1 capture / compare
void TIM17_IRQHandler(void) {
	TIM17->SR &=~TIM_SR_UIF;		//clear the flag
	_tim17_isrptr();				//execute user handler
}
#endif

//global variables
//define your chips here
//declare pins based on chip packaging
//ALL PINS ARE MAPPED, WHETHER THEY EXIST OR NOT
//*********************************************************
//SO MAKE SURE THAT THE PINS YOU PICKED ACTUALLY EXIST FOR YOUR CHIP/PACKAGE
//*********************************************************
//Pin  0..15 -> GPIOA
//Pin 16..31 -> GPIOB
//Pin 32..47 -> GPIOC
//Pin 48..63 -> GPIOD
//Pin 64..79 -> GPIOE
//Pin 80..95 -> GPIOF
//Pin 96..111 -> GPIOG
const PIN2GPIO GPIO_PinDef[]={
	{GPIOA, 1<< 0},						//ARMduino Pin  0 = PA0
	{GPIOA, 1<< 1},						//ARMduino Pin  1 = PA1
	{GPIOA, 1<< 2}, 					//ARMduino Pin  2 = PA2
	{GPIOA, 1<< 3},						//ARMduino Pin  3 = PA3
	{GPIOA, 1<< 4},						//ARMduino Pin  4 = PA4
	{GPIOA, 1<< 5},						//ARMduino Pin  5 = PA5
	{GPIOA, 1<< 6},						//ARMduino Pin  6 = PA6
	{GPIOA, 1<< 7},						//ARMduino Pin  7 = PA7
	{GPIOA, 1<< 8},						//ARMduino Pin  8 = PA8
	{GPIOA, 1<< 9},						//ARMduino Pin  9 = PA9
	{GPIOA, 1<<10},						//ARMduino Pin 10 = PA10
	{GPIOA, 1<<11},						//ARMduino Pin 11 = PA11
	{GPIOA, 1<<12},						//ARMduino Pin 12 = PA12
	{GPIOA, 1<<13},						//ARMduino Pin 13 = PA13
	{GPIOA, 1<<14},						//ARMduino Pin 14 = PA14
	{GPIOA, 1<<15},						//ARMduino Pin 15 = PA15
	
	{GPIOB, 1<< 0},						//ARMduino Pin 16 = PB0
	{GPIOB, 1<< 1},						//ARMduino Pin 17 = PB1
	{GPIOB, 1<< 2},						//ARMduino Pin 18 = PB2
	{GPIOB, 1<< 3},						//ARMduino Pin 19 = PB3
	{GPIOB, 1<< 4},						//ARMduino Pin 20 = PB4
	{GPIOB, 1<< 5},						//ARMduino Pin 21 = PB5
	{GPIOB, 1<< 6},						//ARMduino Pin 22 = PB6
	{GPIOB, 1<< 7},						//ARMduino Pin 23 = PB7
	{GPIOB, 1<< 8},						//ARMduino Pin 24 = PB9
	{GPIOB, 1<< 9},						//ARMduino Pin 25 = PB10
	{GPIOB, 1<<10},						//ARMduino Pin 26 = PB11
	{GPIOB, 1<<11},						//ARMduino Pin 27 = PB12
	{GPIOB, 1<<12},						//ARMduino Pin 28 = PB13
	{GPIOB, 1<<13},						//ARMduino Pin 29 = PB14
	{GPIOB, 1<<14},						//ARMduino Pin 30 = PB15
	{GPIOB, 1<<15},						//ARMduino Pin 31 = PB16
	
	{GPIOC, 1<< 0},						//ARMduino Pin 32 = PC0
	{GPIOC, 1<< 1},						//ARMduino Pin 33 = PC1
	{GPIOC, 1<< 2},						//ARMduino Pin 34 = PC2
	{GPIOC, 1<< 3},						//ARMduino Pin 35 = PC3
	{GPIOC, 1<< 4},						//ARMduino Pin 36 = PC4
	{GPIOC, 1<< 5},						//ARMduino Pin 37 = PC5
	{GPIOC, 1<< 6},						//ARMduino Pin 38 = PC6
	{GPIOC, 1<< 7},						//ARMduino Pin 39 = PC7
	{GPIOC, 1<< 8},						//ARMduino Pin 40 = PC8
	{GPIOC, 1<< 9},						//ARMduino Pin 41 = PC9
	{GPIOC, 1<<10},						//ARMduino Pin 42 = PC10
	{GPIOC, 1<<11},						//ARMduino Pin 43 = PC11
	{GPIOC, 1<<12},						//ARMduino Pin 44 = PC12
	{GPIOC, 1<<13},						//ARMduino Pin 45 = PC13
	{GPIOC, 1<<14},						//ARMduino Pin 46 = PC14
	{GPIOC, 1<<15},						//ARMduino Pin 47 = PC15
	
	{GPIOD, 1<< 0},						//ARMduino Pin 48 = PD0
	{GPIOD, 1<< 1},						//ARMduino Pin 49 = PD1
	{GPIOD, 1<< 2},						//ARMduino Pin 50 = PD2
	{GPIOD, 1<< 3},						//ARMduino Pin 51 = PD3
	{GPIOD, 1<< 4},						//ARMduino Pin 52 = PD4
	{GPIOD, 1<< 5},						//ARMduino Pin 53 = PD5
	{GPIOD, 1<< 6},						//ARMduino Pin 54 = PD6
	{GPIOD, 1<< 7},						//ARMduino Pin 55 = PD7
	{GPIOD, 1<< 8},						//ARMduino Pin 56 = PD8
	{GPIOD, 1<< 9},						//ARMduino Pin 57 = PD9
	{GPIOD, 1<<10},						//ARMduino Pin 58 = PD10
	{GPIOD, 1<<11},						//ARMduino Pin 59 = PD11
	{GPIOD, 1<<12},						//ARMduino Pin 60 = PD12
	{GPIOD, 1<<13},						//ARMduino Pin 61 = PD13
	{GPIOD, 1<<14},						//ARMduino Pin 62 = PD14
	{GPIOD, 1<<15},						//ARMduino Pin 63 = PD15
	
#if defined(RCC_AHBENR_GPIOFEN)			//GPIOF not present on all chips
	{GPIOF, 1<< 0},						//ARMduino Pin 40 = PF0
	{GPIOF, 1<< 1},						//ARMduino Pin 41 = PF1
	{GPIOF, 1<< 2},						//ARMduino Pin 42 = PF2
	{GPIOF, 1<< 3},						//ARMduino Pin 43 = PF3
	{GPIOF, 1<< 4},						//ARMduino Pin 44 = PF4
	{GPIOF, 1<< 5},						//ARMduino Pin 45 = PF5
	{GPIOF, 1<< 6},						//ARMduino Pin 46 = PF6
	{GPIOF, 1<< 7},						//ARMduino Pin 47 = PF7
	{GPIOF, 1<< 8},						//ARMduino Pin 40 = PF8
	{GPIOF, 1<< 9},						//ARMduino Pin 41 = PF9
	{GPIOF, 1<<10},						//ARMduino Pin 42 = PF10
	{GPIOF, 1<<11},						//ARMduino Pin 43 = PF11
	{GPIOF, 1<<12},						//ARMduino Pin 44 = PF12
	{GPIOF, 1<<13},						//ARMduino Pin 45 = PF13
	{GPIOF, 1<<14},						//ARMduino Pin 46 = PF14
	{GPIOF, 1<<15},						//ARMduino Pin 47 = PF15
#endif

