dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
#if defined(RCC_AHBENR_GPIOGEN)						//GPIOG not present on all chips
	{GPIOG, 1<< 0},						//ARMduino Pin 48 = PG0
	{GPIOG, 1<< 1},						//ARMduino Pin 49 = PG1
	{GPIOG, 1<< 2},						//ARMduino Pin 50 = PG2
	{GPIOG, 1<< 3},						//ARMduino Pin 51 = PG3
	{GPIOG, 1<< 4},						//ARMduino Pin 52 = PG4
	{GPIOG, 1<< 5},						//ARMduino Pin 53 = PG5
	{GPIOG, 1<< 6},						//ARMduino Pin 54 = PG6
	{GPIOG, 1<< 7},						//ARMduino Pin 55 = PG7
	{GPIOG, 1<< 8},						//ARMduino Pin 48 = PG8
	{GPIOG, 1<< 9},						//ARMduino Pin 49 = PG9
	{GPIOG, 1<<10},						//ARMduino Pin 50 = PG10
	{GPIOG, 1<<11},						//ARMduino Pin 51 = PG11
	{GPIOG, 1<<12},						//ARMduino Pin 52 = PG12
	{GPIOG, 1<<13},						//ARMduino Pin 53 = PG13
	{GPIOG, 1<<14},						//ARMduino Pin 54 = PG14
	{GPIOG, 1<<15},						//ARMduino Pin 55 = PG15
#endif
};

//configure gpio DDR mode (cnf1..0 + mod1..0 bits)
void GPIO_DDR(GPIO_TypeDef * GPIOx, uint32_t mask, uint32_t mode) {
	uint8_t pos;
	//uint32_t pin_mask;

	for (pos=0; pos < 16; pos++) {
		//looking for pin position / mask
		//pin_mask = 1ul << pos;
		if (mask & (1ul << pos)) {
			//we have found the pos / pin_mask
			if ((mode & GPIOMODE_OUTPUT) || (mode & GPIOMODE_AF)) {
				GPIOx->OSPEEDR &=~(0x03ul << (2 * pos));	//clear ospeeder
				GPIOx->OSPEEDR |= (0x01ul << (2 * pos));	//set to medium speed (0x01)

				GPIOx->OTYPER &=~(1ul << pos);				//clear otyper
				GPIOx->OTYPER |= ((mode & GPIOMODE_PP)?0ul:1ul) << pos;	//0->pp, 1->od
			}

			GPIOx->MODER &=~(0x03 << (2 * pos));			//clear moder
			GPIOx->MODER |= (mode & 0x03) << (2 * pos);		//set moder

			GPIOx->PUPDR &=~(0x03 << (2 * pos));			//clear pupdr
			GPIOx->PUPDR |= ((mode >> 4) & 0x03) << (2 * pos);	//set pupdr
		}
	}
}

//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	//simple implementation - just INPUT/OUTPUT supported
	//if (mode==INPUT) GIO_IN(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	//else GIO_OUT(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);

	//fancier implementation: supports INPUT, INPUT_PULLUP, OUTPUT
	//additional features commented out
	switch (mode) {
	case INPUT: 		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INFL); break;			//floating input
	case INPUT_PULLUP: 	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INPU); /*IO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); */break;			//input with pullup
	case INPUT_PULLDN:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INPD); /*IO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask); */break;			//input with pulldown
	case INPUT_ANALOG:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_INAN); break;			//analog input
	case OUTPUT:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTPP); break;			//floating input
	case OUTPUT_OD:		GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_OUTOD); break;			//floating input
	case OUTPUT_AFPP:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFPP); break;			//floating input
	case OUTPUT_AFOD:	GPIO_DDR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask, GPIOMODE_AFOD); break;			//floating input
	default: break;			//do nothing
	}

}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	if (val==LOW) IO_CLR(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
	else IO_SET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	return (IO_GET(GPIO_PinDef[pin].gpio, GPIO_PinDef[pin].mask))?HIGH:LOW;
}
//end GPIO

#if defined(USE_PWM)
//analogWrite
void analogWrite(PIN_TypeDef pin, uint16_t dc) {
	dc=(dc>PWM_PR)?PWM_PR:dc;				//bound dc to [0..PWM_PR]
	switch (pin) {							//configure TIM2-OCi channels based on pin # -> for STM32F100
#if defined(TIM1)
	case PA8:									//pin 8 = PA8/TIM1-CH1
		GIO_AFPP(GPIO_PinDef[8].gpio, GPIO_PinDef[8].mask);
		TIM1->CCR1 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA9:									//pin 9 = PA9/TIM1-CH2
		GIO_AFPP(GPIO_PinDef[9].gpio, GPIO_PinDef[9].mask);
		TIM1->CCR2 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA10:								//pin 10 = PA10/TIM1-CH3
		GIO_AFPP(GPIO_PinDef[10].gpio, GPIO_PinDef[10].mask);
		TIM1->CCR3 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA11:								//pin 11 = PA11/TIM1-CH4
		GIO_AFPP(GPIO_PinDef[11].gpio, GPIO_PinDef[11].mask);
		TIM1->CCR4 = dc;					//set duty cycle
		TIM1->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM2)
	case PA1:									//pin 1 = PA1/TIM2-CH2
		GIO_AFPP(GPIO_PinDef[1].gpio, GPIO_PinDef[1].mask);
		TIM2->CCR2 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PA2:									//pin 2 = PA2/TIM2-CH3
		GIO_AFPP(GPIO_PinDef[2].gpio, GPIO_PinDef[2].mask);
		TIM2->CCR3 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PA3:									//pin 3 = PA3/TIM2-CH4
		GIO_AFPP(GPIO_PinDef[3].gpio, GPIO_PinDef[3].mask);
		TIM2->CCR4 = dc;					//set duty cycle
		TIM2->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM3)
	case PA6:									//pin 6 = PA6/TIM3-CH1
		GIO_AFPP(GPIO_PinDef[6].gpio, GPIO_PinDef[6].mask);
		TIM3->CCR1 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PA7:									//pin 7 = PA7/TIM3-CH2
		GIO_AFPP(GPIO_PinDef[7].gpio, GPIO_PinDef[7].mask);
		TIM3->CCR2 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB0:								//pin 16 = PB0/TIM3-CH3
		GIO_AFPP(GPIO_PinDef[16].gpio, GPIO_PinDef[16].mask);
		TIM3->CCR3 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB1:								//pin 17 = PB1/TIM3-CH4
		GIO_AFPP(GPIO_PinDef[17].gpio, GPIO_PinDef[17].mask);
		TIM3->CCR4 = dc;					//set duty cycle
		TIM3->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
#if defined(TIM4)
	case PB6:								//pin 22 = PB6/TIM4-CH1
		GIO_AFPP(GPIO_PinDef[22].gpio, GPIO_PinDef[22].mask);
		TIM4->CCR1 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(1-1)));		//1->enable the output
		break;
	case PB7:								//pin 23 = PB7/TIM4-CH2
		GIO_AFPP(GPIO_PinDef[23].gpio, GPIO_PinDef[23].mask);
		TIM4->CCR2 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(2-1)));		//1->enable the output
		break;
	case PB8:								//pin 24 = PB8/TIM4-CH3
		GIO_AFPP(GPIO_PinDef[24].gpio, GPIO_PinDef[24].mask);
		TIM4->CCR3 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(3-1)));		//1->enable the output
		break;
	case PB9:								//pin 25 = PB9/TIM4-CH4
		GIO_AFPP(GPIO_PinDef[25].gpio, GPIO_PinDef[25].mask);
		TIM4->CCR4 = dc;					//set duty cycle
		TIM4->CCER|= (1<<(4*(4-1)));		//1->enable the output
		break;
#endif
	default: break;
	}

