dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
}
#endif										//pwm

#if defined(USE_ADC1)
//analog to digital converter on ADC1
//ain/analog input channel: ain valid values: 0..15, 16=temperature sensor, 17=Vrefint
//***user needs to be configured as floating input***
uint16_t analogRead(AIN_TypeDef ain) {
	ADC1->ISR &= ~(1<<2);					//clear the eoc flag
	//ADC1->CR1 = (ADC1->CR1 &~0x1f) | (ain & 0x1f);	//pick the adc channel
	//ADC1->CR2|= (1<<0);					//start the conversion
	ADC1->CHSELR = (1ul<<ain) & 0x03fffful;		//define the first (and only) adc ch
	ADC1->CR |= (1<<2);						//start conversion
	while ((ADC1->ISR & (1<<2)) == 0) continue;	//wait for conversion to end (EOC set at end of conversion)
	return ADC1->DR;						//return adc result and clears the EOC bit
}
#endif										//adc1

//attach an exti
//pin 0..15
void attachInterrupt(PIN_TypeDef pin, void (*isrptr)(void), uint8_t mode) {
    GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
    uint16_t mask;                  // = GPIO_PinDef[pin].mask;
    uint16_t pos;                    //pin position

    //mode = mode & 0x0f
    //figure out the mask
    if (gpio == GPIOA) mask = 0x00;	//exti on GPIOx: 0x00->A, 0x01->B, ..., 0x06->G
    if (gpio == GPIOB) mask = 0x01;
    if (gpio == GPIOC) mask = 0x02;
    if (gpio == GPIOD) mask = 0x03;
    //if (gpio == GPIOE) mask = 0x04;
    if (gpio == GPIOF) mask = 0x05;
    //if (gpio == GPIOG) mask = 0x06;

    //scan for pin position
    for (pos = 0; pos < 16; pos ++)
        if (GPIO_PinDef[pin].mask & (1<<pos)) break;
    //not pos has the pin position

    //figure out the line 0..15
         if (pos < 4) SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~(0x0f << (4*(pos- 0)))) | (mask << (4*(pos - 0)));  //set the line 0..4
    else if (pos < 8) SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~(0x0f << (4*(pos- 4)))) | (mask << (4*(pos - 4)));  //set the line 5..8
    else if (pos <12) SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~(0x0f << (4*(pos- 8)))) | (mask << (4*(pos - 8)));  //set the line 9..12
    else if (pos <16) SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~(0x0f << (4*(pos-12)))) | (mask << (4*(pos -12)));  //set the line 13..16

    //figure out the trigger: rising or falling
    switch (mode) {
    case CHANGE:	EXTI->FTSR |= (1<<pos); EXTI->RTSR |= (1<<pos); break;		//set falling trigger
    case RISING: 	EXTI->FTSR &=~(1<<pos); EXTI->RTSR |= (1<<pos); break;		//set rising trigger
    case FALLING:
    default: 		EXTI->FTSR |= (1<<pos); EXTI->RTSR &=~(1<<pos); break;		//set falling trigger (default)
    }

    //install the user handler
	_isrptr_exti[pos] = isrptr;
	//set it to the lowest priority
    switch (pos) {
    case 0:
    case 1: NVIC_SetPriority(EXTI0_1_IRQn, 15); NVIC_EnableIRQ(EXTI0_1_IRQn); break;
    case 2:
    case 3: NVIC_SetPriority(EXTI2_3_IRQn, 15); NVIC_EnableIRQ(EXTI2_3_IRQn); break;
    case 4:
    case 5:
    case 6:
    case 7:
    case 8:
    case 9:
    case 10:
    case 11:
    case 12:
    case 13:
    case 14:
    case 15: NVIC_SetPriority(EXTI4_15_IRQn, 15); NVIC_EnableIRQ(EXTI4_15_IRQn); break;
    default: break;		//do nothing
    }

    //activate the interrupt
    EXTI->PR |= (1<<pos);                           //clear the flag
    EXTI->IMR |= (1<<pos);                          //enable the exti
}

//deactivate an interrupt
void detachInterrupt(PIN_TypeDef pin) {
    //GPIO_TypeDef *gpio = GPIO_PinDef[pin].gpio;
    //uint16_t mask;                  // = GPIO_PinDef[pin].mask;
    uint16_t pos;                    //pin position

    //mode = mode & 0x0f
    //figure out the mask
    //if (gpio == GPIOA) mask = 0x00;	//exti on GPIOx: 0x00->A, 0x01->B, ..., 0x06->G
    //if (gpio == GPIOB) mask = 0x01;
    //if (gpio == GPIOC) mask = 0x02;
    //if (gpio == GPIOD) mask = 0x03;
    //if (gpio == GPIOE) mask = 0x04;
    //if (gpio == GPIOF) mask = 0x05;
    //if (gpio == GPIOG) mask = 0x06;

    //scan for pin position
    for (pos = 0; pos < 16; pos ++)
        if (GPIO_PinDef[pin].mask & (1<<pos)) break;
    //not pos has the pin position

    //figure out the line 0..16
    //     if (pos <= 4) SYSCFG->EXTICR[0] = (SYSCFG->EXTICR[0] &~(0x0f << (pos- 0))) | (mask << (pos - 0));  //set the line 0..4
    //else if (pos <= 8) SYSCFG->EXTICR[1] = (SYSCFG->EXTICR[1] &~(0x0f << (pos- 4))) | (mask << (pos - 4));  //set the line 5..8
    //else if (pos <=12) SYSCFG->EXTICR[2] = (SYSCFG->EXTICR[2] &~(0x0f << (pos- 8))) | (mask << (pos - 8));  //set the line 9..12
    //else if (pos <=16) SYSCFG->EXTICR[3] = (SYSCFG->EXTICR[3] &~(0x0f << (pos-12))) | (mask << (pos -12));  //set the line 13..16

    //figure out the trigger: rising or falling
    //switch (mode) {
    //case CHANGE:	EXTI->FTSR |= (1<<pos); EXTI->RTSR |= (1<<pos); break;		//set falling trigger
    //case RISING: 	EXTI->RTSR |= (1<<pos); break;		//set rising trigger
    //case FALLING:
    //default: 		EXTI->FTSR |= (1<<pos); break;		//set falling trigger (default)
    //}

    //install the default handler
	_isrptr_exti[pos] = empty_handler;					//isrptr;
	//set it to the lowest priority, and disable the IRQ
    switch (pos) {
    case 0:
    case 1: NVIC_SetPriority(EXTI0_1_IRQn, 15); NVIC_DisableIRQ(EXTI0_1_IRQn); break;
    case 2:
    case 3: NVIC_SetPriority(EXTI2_3_IRQn, 15); NVIC_DisableIRQ(EXTI2_3_IRQn); break;
    case 4:
    case 5:
    case 6:
    case 7:
    case 8:
    case 9:
    case 10:
    case 11:
    case 12:
    case 13:
    case 14:
    case 15: NVIC_SetPriority(EXTI4_15_IRQn, 15); NVIC_DisableIRQ(EXTI4_15_IRQn); break;
    default: break;		//do nothing
    }

    //activate the interrupt
    EXTI->PR |= (1<<pos);                           //clear the flag
    EXTI->IMR &=~(1<<pos);                          //disable the exti
}

#if defined(USE_SPI1)
//spi routines
//send char via hardware spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI1Write(uint8_t order, uint8_t dat) {
    if (order == LSBFIRST) SPI1->CR1 |= SPI_CR1_LSBFIRST;  	//'1'->LSB first
    else SPI1->CR1 &=~SPI_CR1_LSBFIRST;                    	//'0'->MSB first
    while ((SPI1->SR & SPI_SR_TXE)==0) continue;     		//wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI1->DR = dat;                          				//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI1->SR & SPI_SR_BSY) continue;      			//'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI1->DR;                         				//return spi data buffer
}

//read spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI1Read(uint8_t order) {
    //uint8_t tmp;
    if (order == LSBFIRST) SPI1->CR1 |= SPI_CR1_LSBFIRST;  	//'1'->LSB first
    else SPI1->CR1 &=~SPI_CR1_LSBFIRST;                    	//'0'->MSB first
    while ((SPI1->SR & SPI_SR_TXE)==0) continue;     		//wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI1->DR = /*dat*/0x00;                      			//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI1->SR & SPI_SR_BSY) continue;      			//'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI1->DR;                         				//return spi data buffer
}

#endif											//spi1

#if defined(USE_SPI2)
//spi routines
//send char via hardware spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI2Write(uint8_t order, uint8_t dat) {
    if (order == LSBFIRST) SPI2->CR1 |= SPI_CR1_LSBFIRST;  //'1'->LSB first
    else SPI2->CR1 &=~SPI_CR1_LSBFIRST;                    //'0'->MSB first
    while ((SPI2->SR & SPI_SR_TXE)==0) continue;     //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI2->DR = dat;                          	//load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI2->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI2->DR;                         	//return spi data buffer
}

//read spi
//MISO on PC7, MOSI on PC6, SCK on PC5
//Order = LSBFIRST or MSBFIRST
uint8_t SPI2Read(uint8_t order) {
    //uint8_t tmp;
    if (order == LSBFIRST) SPI2->CR1 |= SPI_CR1_LSBFIRST;  //'1'->LSB first
    else SPI2->CR1 &=~SPI_CR1_LSBFIRST;                    //'0'->MSB first
    while ((SPI2->SR & SPI_SR_TXE)==0) continue;      //wait for transmit buffer to be empty (bit 1 goes to 1)
    SPI2->DR = /*dat*/0x00;                      //load the transmission buffer -> transmission starts. this approach can be risk for reads
    //consider test busy signal
    while (SPI2->SR & SPI_SR_BSY) continue;      //'1'->SPI is buy, '0'->SPI is not busy
    //comment the above line for higher throughput if you don't care about the read-back
    return SPI2->DR;                         	//return spi data buffer
}

#endif											//spi2

#if defined(USE_UART1)
//initialize uart1
void serial1Begin(uint32_t baudrate) {
	uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

    USART1->CR1 &=~(1<<0);			//'0'->disable uart, '1'->enable uart
    USART1->CR1 =	(0<<28) | (0<<12) |	//0b00->1 start bit, 8 data bits, n stop bit; 0b01->1 start bit, 9 data bits, n stop bit, 0b10->1 start bit 7 data bits, n stop bit
    				(0<<27) |		//0->disable end of block interrupt
    				(0<<26) |		//0->receiver timeout interrupt disabled
    				(0x00<<21) |	//0b00000->driver enable assertion time
    				(0x00<<16) |	//0b00000->driver enable disassertion time
    				(0<<15) |		//0->oversampling by 16
    				(0<<14) |		//0->character match interrupt disabled
    				(0<<13) |		//0->receiver in active mode permanently
    				//bit 12 set earlier
    				(0<<11) |		//0->idle line to wake up uart
    				(0<<10) |		//0->no parity
    				(0<<9) |		//0->even parity
    				(0<<8) |		//0->disable PE interrupt
    				(0<<7) |		//0->disable txie)
    				(0<<6) |		//0->disable transmission complete interrupt
    				(0<<5) |		//0->disable receiver buffer not empty interrupt
    				(0<<4) |		//0->disable idle interrupt
    				(1<<3) |		//0->transmitter disabled, 1->transmitter enabled
    				(1<<2) |		//0->receiver disabled, 1->receiver enabled
    				//bit 1 reserved
    				(0<<0) |		//0->disable uart, 1->enable uart
    				0x00;
    USART1->CR2 = 	(0x00<<28) |	//address of the uart
    				(0x00<<24) |	//address of the uart
    				(0<<23) |		//0->disable receiver time out
    				(0x00<<21) |	//00->measurement of the start bit used to detect baud rate
    				(0<<20) |		//auto baud rate disabled
    				(0<<19) |		//0->data bit 0 first
    				(0<<18) |		//0->data transmitted / received in positive logic
    				(0<<17) |		//0->tx in positive logic
    				(0<<16) |		//0->rx in positive logic
    				(0<<15) |		//0->tx/rx pins not swapped, 1->tx/rx pins swapped
    				(0x00<<12) |	//00->1 stop bit, 10->2 stop bit, 11->1.5 stop bit
    				(0<<11) |		//0->sclk disabled
    				(0<<10) |		//0->sclk idles low
    				(0<<9) |		//0->clock on first data capture
    				(0<<8) |		//0->clock on the last bit is not data pulse
    				(0<<4) |		//0->4 bit address detection
    				0x00;
    USART1->CR3 =	(0<<15) |		//0->driver enable signal active high
    				(0<<14) |		//0->disable driver more
    				0x00;			//reset value
    //set the baudrate register
    uartdiv = F_UART / baudrate;
    if (USART1->CR1 & (1<<15)) {		//oversample by 8
    	uartdiv = uartdiv * 2;
    	uartdiv = 	(uartdiv &~0x000f) |	//clear lowest 4 bits
    				(1<<3) |			//bit 3 is always set
    				((uartdiv >> 1) & 0x07);	//keep the lowest 3 bits
    }
    USART1->BRR = uartdiv;
    //UARTx->BRR = F_UART / baudrate * ((UARTx->CR1 & (1<<15))?2:1);		//per datasheet, for OVER8=0 or 1

    //UARTx->DR = 0;					//reset the data register
    //UARTx->SR = 0;					//reset the data register

