dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
//uart2 print a string
void serial2Print(char *str) {
	while (*str) serial2Write(*str++);
}

//uart2 print a string + return
void seria21Println(char *str) {
	serial2Print(str);						//print the string
	serial2Print((char *) "\n\r");					//print the return
}

//test if uart2 receiver is available (=has data)
//return true if transmission on uart2 has completed
uint8_t serial2Available(void) {
	//return (UARTx->SR & USART_SR_TC)?true:false;
	return (USART2->ISR & USART_ISR_RXNE);
}

//test if uart2 transmitter is busy
//return true if transmission on uart2 has completed
uint8_t serial2Busy(void) {
	//return (UARTx->SR & USART_SR_TC)?true:false;
	return !(USART2->ISR & USART_ISR_TXE);
}
#endif								//usart1

#if defined(USE_UART3)
//initialize uart3
void serial3Begin(uint32_t baudrate) {
	uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APB2ENR |= RCC_APB2ENR_USART3EN;

    USART3->CR1 &=~(1<<0);			//'0'->disable uart, '1'->enable uart
    USART3->CR1 =	(0<<28) | (0<<12) |	//0b00->1 start bit, 8 data bits, n stop bit; 0b01->1 start bit, 9 data bits, n stop bit, 0b10->1 start bit 7 data bits, n stop bit
    				(0<<27) |		//0->disable end of block interrupt
    				(0<<26) |		//0->receiver timeout interrupt disabled
    				(0x00<<21) |	//0b00000->driver enable assertion time
    				(0x00<<16) |	//0b00000->driver enable disassertion time
    				(0<<15) |		//0->oversampling by 16
    				(0<<14) |		//0->character match interrupt disabled
    				(0<<13) |		//0->receiver in active mode permanently
    				//bit 12 set earlier
    				(0<<11) |		//0->idle line to wake up uart
    				(0<<10) |		//0->no parity
    				(0<<9) |		//0->even parity
    				(0<<8) |		//0->disable PE interrupt
    				(0<<7) |		//0->disable txie)
    				(0<<6) |		//0->disable transmission complete interrupt
    				(0<<5) |		//0->disable receiver buffer not empty interrupt
    				(0<<4) |		//0->disable idle interrupt
    				(1<<3) |		//0->transmitter disabled, 1->transmitter enabled
    				(1<<2) |		//0->receiver disabled, 1->receiver enabled
    				//bit 1 reserved
    				(0<<0) |		//0->disable uart, 1->enable uart
    				0x00;
    USART3->CR2 = 	(0x00<<28) |	//address of the uart
    				(0x00<<24) |	//address of the uart
    				(0<<23) |		//0->disable receiver time out
    				(0x00<<21) |	//00->measurement of the start bit used to detect baud rate
    				(0<<20) |		//auto baud rate disabled
    				(0<<19) |		//0->data bit 0 first
    				(0<<18) |		//0->data transmitted / received in positive logic
    				(0<<17) |		//0->tx in positive logic
    				(0<<16) |		//0->rx in positive logic
    				(0<<15) |		//0->tx/rx pins not swapped, 1->tx/rx pins swapped
    				(0x00<<12) |	//00->1 stop bit, 10->2 stop bit, 11->1.5 stop bit
    				(0<<11) |		//0->sclk disabled
    				(0<<10) |		//0->sclk idles low
    				(0<<9) |		//0->clock on first data capture
    				(0<<8) |		//0->clock on the last bit is not data pulse
    				(0<<4) |		//0->4 bit address detection
    				0x00;
    USART3->CR3 =	(0<<15) |		//0->driver enable signal active high
    				(0<<14) |		//0->disable driver more
    				0x00;			//reset value
    //set the baudrate register
    uartdiv = F_UART / baudrate;
    if (USART3->CR1 & (1<<15)) {		//oversample by 8
    	uartdiv = uartdiv * 2;
    	uartdiv = 	(uartdiv &~0x000f) |	//clear lowest 4 bits
    				(1<<3) |			//bit 3 is always set
    				((uartdiv >> 1) & 0x07);	//keep the lowest 3 bits
    }
    USART3->BRR = uartdiv;
    //UARTx->BRR = F_UART / baudrate * ((UARTx->CR1 & (1<<15))?2:1);		//per datasheet, for OVER8=0 or 1

    //UARTx->DR = 0;					//reset the data register
    //UARTx->SR = 0;					//reset the data register

    //enable uart1
    USART3->CR1 |= (1<<0);			//'0'->disable uart, '1'->enable uart

    //configure the TX-PA9/RX-PA10 pins - GPIO clock assumed enabled here previously
    //RX as floating input/AF input, AF1
    IO_INFL(GPIOA, 1<<10); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * (10-8)))) | (GPIOMODE_AF1<<(4 * (10-8)));
	//TX as AFPP, AF1
    IO_AFPP(GPIOA, 1<< 9); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * ( 9-8)))) | (GPIOMODE_AF1<<(4 * ( 9-8)));
}

//uart3 send a char
void serial3Write(char dat) {
    while (!(USART3->ISR & USART_ISR_TXE));    	//wait for the transmission buffer to be empty
    //while (uart1_busy()) continue;    			//wait for the transmission buffer to be empty
    USART3->TDR = dat;                        	//load the data buffer
    //while (!(UARTx->SR & (1<<6)));    		//wait for the transmission to complete
}

//uart3 returns a char
unsigned char seria31Read(void) {
    //while (!(UARTx->SR & USART_SR_RXNE));  	//wait for the receipt buffer to be empty
    return USART3->RDR;                       	//save the transmission buffer
}

//uart3 print a string
void serial3Print(char *str) {
	while (*str) uart1_put(*str++);
}

//uart3 print a string + return
void seria31Println(char *str) {
	serial3Print(str);						//print the string
	serial3Print((char *)"\n\r");					//print the return
}

//test if uart3 receiver is available (=has data)
//return true if transmission on uart3 has completed
uint8_t seria31Available(void) {
	//return (UARTx->SR & USART_SR_TC)?true:false;
	return (USART3->ISR & USART_ISR_RXNE);
}

//test if uart3 transmitter is busy
//return true if transmission on uart3 has completed
uint8_t seria31Busy(void) {
	//return (UARTx->SR & USART_SR_TC)?true:false;
	return !(USART3->ISR & USART_ISR_TXE);
}
#endif								//usart1

#if defined(USE_TIM1)
//initialize tim1 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tim1_init(uint32_t ps) {
	//route the clock to timer
	RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;

	//source from internal clock -> disable slave mode
	TIM1->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIM1->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIM1->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIM1->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIM1->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIM1->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIM1->SR &=~(TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIM1->DIER &=~(TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIM1->PSC = ps - 1;					//set the prescaler
	TIM1->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIM1->ARR = -1;						//auto reload register / period = 0; - need to change for downcounters
	TIM1->CNT = 0;						//reset the counter

	//enable the timer.
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//set tim1_oc1 period
//pr is 16-bit. 32-bit used for compatability;
void tim1_setpr1(uint32_t pr) {
	//save the period value
	_tim1_oc1 = pr - 1;
	TIM1->CCR1 = _tim1_oc1;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

