dannyf00/ARMduino/STM32F0/armduino_stm32f0xx.c
	//configure adc
	ADC1->CFGR1 = 	(0x00<<26) |			//0->awd on channel 0
					(0<<23) |				//0->AWD disabled
					(0<<22) |				//0->AWD on all channels (but disabled by bit 22
					(1<<16) |				//1->enable discontinuous conversion
					(0<<15) |				//0->auto off disabled
					(0<<14) |				//0->wait conversion disabled
					(0<<13) |				//0->single conversion mode, 1->continuous mode
					(0<<12) |				//0->adc data register preserved in overrun
					(0x00<<10) |			//00->hardware external trigger disabled
					(0x00<<6) |				//0000->external on TRG0 - but disabled
					(0<<5) |				//0->right aligned, 1->left aligned
					(0x00<<3) |				//00->data resolution = 12bit, 01->10bit, 10->8bit, 11->6bit
					(0<<2) |				//0->upward scan
					(0<<1) |				//0->DMA one shot mode selected
					(0<<0) |				//0->DMA disabled
					0x00;
	ADC1->CFGR2 = 	(0x02 << 30);			//00->adc clock, 01->PCLK/2, 10->PCLK/4 -> no jitter
	//set adc sample time
	//0b111->239.5 cycles for all channels
	ADC1->SMPR = 	(ADC_SMPR << (3 * 0)) |
					0x00;
	//set adc channel sequence
	//ADCx->SQR3 = ADCx->SQR2 = ADCx->SQR1 = 0;							//0->1 conversion

	//start self-calibration
	ADC1->CR =	0;							//reset CR
	ADC1->CR = (1<<15);						//start the calibration
	while (ADC1->CR & (1<<15)) continue;	//wait for ADC calibration to finish
	//uint32_t _adc_calfactor = ADCx->DR;				//save adc calibration factor

	//optional: enable temperature sensors
	ADC->CCR |= 	(1ul<<23) |				//1->enable temperature sensor
					(1ul<<22) |				//1->enable Vrefint. 1.20v nominal
					0x00;

	ADC1->CR = 	(1<<0);						//enable aden
	while ((ADC1->ISR & (1<<0)) == 0) continue;	//wait for the adc to be ready
	//now adc is calibrated
#endif

#if defined(USE_SPI1)
    //configure spi1
    //route clock to spi1
    RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;

    //disable spi module before configuring it
    SPI1->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI1->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI1_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI1->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI1->DR = 0x00;				//clear the buffer
    SPI1->SR = 0x00;				//clear the status register
    SPI1->CR1 |= (1<<6);			//enable spi1

    //configure output pins
#endif

#if defined(USE_SPI2)
    //configure SPI2
    //route clock to SPI2
    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;

    //disable spi module before configuring it
    SPI2->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI2->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI2_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI2->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI2->DR = 0x00;				//clear the buffer
    SPI2->SR = 0x00;				//clear the status register
    SPI2->CR1 |= (1<<6);			//enable SPI2

    //configure output pins
#endif

#if defined(USE_SPI3)
    //configure SPI3
    //route clock to SPI3
    RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;

    //disable spi module before configuring it
    SPI3->CR1 &=~(1<<6);			//'1'->enable spi, '0'->disable spi

    SPI3->CR1 = (0<<15) |			//'0'->2-line unidirectional enabled, '1'->1 line bidirectional enabled
    			(0<<14) |			//'0'->output disabled in bidirectional mode, '1'->output enabled in bidirectional mode
    			(0<<13) |			//'0'->disable crc calculation, '1'->enable crc calculation
    			(0<<12) |			//'0'->next transmission if from tx buffer, '1'->next transmission is from crc
    			(0<<11) |			//'0'->8-bit per frame selected, '1'->16-bit per frame selected
    			(0<<10) |			//'0'->full duplex (rx and tx), '1'->rx only (tx disabled)
    			(0<< 9) |			//'0'->disable software slave management, '1'->enable software slave management
    			(0<< 8) |			//'0'->software slave select -> the state is forced to NSS pin if bit 9 is set
    			(0<< 7) |			//'0'->msb first, '1'->lsb first
    			(0<< 6) |			//'0'->spi disabled, '1'->spi enabled
    			(SPI3_PS<< 3) |		//3-bit value to select spi baud rate. 0->2x,..., 7->256
    			(1<< 2) |			//'0'->slave mode, '1'->master mode
    			(0<< 1) |			//'0'->SCK idles at 0, '1'->SCK idles at 1
    			(0<< 0) |			//'0'->first clock transition is the first data capture, '1'->2nd clock transition is the first data capture
    			0x00;
    SPI3->CR2 = (0<<7) |			//'0'->tx interrupt disabled, '1'->tx interrupt enabled
    			(0<<6) |			//'0'->rx buffer not empty interrupt disabled, '1'->rx buffer not empty interrupt enabled
    			(0<<5) |			//'0'->error interrupt disabled, '1'->error interrupt enabled
    			(0<<3) |			//'0'->slave select output disabled, '1'->slave select output enabled
    			(0<<1) |			//'0'->tx dma disabled, '1'->tx dma enabled
    			(0<<0) |			//'0'->rx dma disabled, '1'->rx dma enabled
    			0x00;
    SPI3->DR = 0x00;				//clear the buffer
    SPI3->SR = 0x00;				//clear the status register
    SPI3->CR1 |= (1<<6);			//enable SPI3

    //configure output pins
#endif

#if defined(USE_I2C)
    //configure i2c
#endif

    //update SystemCoreClock - done in mcu_init()
	//SystemCoreClockUpdate();

}


